InformationRegisters/АС_СчетчикВнутреннихАртикулов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АС_СчетчикВнутреннихАртикулов</Name>
			<Comment>Служебный общий счетчик внутренних артикулов номенклатуры.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Технический ключ строки счетчика.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ПоследнийНомер</Name>
					<Comment>Последний выданный номер внутреннего артикула.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/АС_НоменклатураСервер/Ext/Module.bsl
Функция ПолучитьСледующийВнутреннийАртикул() Экспорт

	КлючСчетчика = "Номенклатура";
	ТранзакцияНачата = Ложь;

	Попытка
		Если Не ТранзакцияАктивна() Тогда
			НачатьТранзакцию();
			ТранзакцияНачата = Истина;
		КонецЕсли;

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(
			"РегистрСведений.АС_СчетчикВнутреннихАртикулов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ключ", КлючСчетчика);
		Блокировка.Заблокировать();

		ПоследнийНомер = 0;
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|Счетчик.ПоследнийНомер КАК ПоследнийНомер
			|ИЗ
			|РегистрСведений.АС_СчетчикВнутреннихАртикулов КАК Счетчик
			|ГДЕ
			|Счетчик.Ключ = &Ключ";
		Запрос.УстановитьПараметр("Ключ", КлючСчетчика);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПоследнийНомер = Выборка.ПоследнийНомер;
		КонецЕсли;

		НовыйНомер = ПоследнийНомер + 1;
		Пока Истина Цикл
			Если НовыйНомер > 99999999 Тогда
				ВызватьИсключение "Нельзя выдать внутренний артикул: исчерпан диапазон INT-00000001 — INT-99999999.";
			КонецЕсли;

			ВнутреннийАртикул = "INT-" + Формат(
				НовыйНомер, "ЧЦ=8; ЧН=00000000; ЧВН=; ЧГ=");
			Если Не ЕстьАртикул(ВнутреннийАртикул) Тогда
				Прервать;
			КонецЕсли;

			НовыйНомер = НовыйНомер + 1;
		КонецЦикла;

		ЗаписьСчетчика = РегистрыСведений.АС_СчетчикВнутреннихАртикулов.СоздатьМенеджерЗаписи();
		ЗаписьСчетчика.Ключ = КлючСчетчика;
		ЗаписьСчетчика.ПоследнийНомер = НовыйНомер;
		ЗаписьСчетчика.Записать();

		Если ТранзакцияНачата Тогда
			ЗафиксироватьТранзакцию();
			ТранзакцияНачата = Ложь;
		КонецЕсли;

		Возврат ВнутреннийАртикул;
	Исключение
		Если ТранзакцияНачата И ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

Функция ЕстьАртикул(Артикул)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|Номенклатура.Ссылка
		|ИЗ
		|Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|Номенклатура.Артикул = &Артикул
		|ИЛИ Номенклатура.АС_ВнутреннийАртикул = &Артикул";
	Запрос.УстановитьПараметр("Артикул", Артикул);

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();

КонецФункции

Функция ЭтоВнутреннийАртикул(Артикул) Экспорт

	Значение = СокрЛП(Строка(Артикул));
	Если СтрДлина(Значение) <> 12 ИЛИ Лев(Значение, 4) <> "INT-" Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Индекс = 5 По 12 Цикл
		Если СтрНайти("0123456789", Сред(Значение, Индекс, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Сред(Значение, 5) <> "00000000";

КонецФункции
